zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_scb_i2c.c
        Cy_SCB_ClearTxInterrupt(base, CY_SCB_TX_INTR_LEVEL);
    }
}

#if (((defined (CY_IP_MXSCB_VERSION) && (CY_IP_MXSCB_VERSION>=3)) || defined (CY_IP_MXS22SCB)) || defined (CY_DOXYGEN))
/*******************************************************************************
* Function Name: Cy_SCB_I2C_SetStretchThreshold
****************************************************************************//**
*
* Sets the stretch threshold value.
*
* \param base
* The pointer to the I2C SCB instance.
*
* \param value
* The stretch threshold value to be set.
* Typically it is the SCL turaround delay (including IO cell delay, SCL rise time,
* analog filter delay), in number of clk_scb cycles.
*
* \note
* * The STRETCH_THRESHOLD value is 0 by default. If there is no device stretching
*   the SCL bus, the delay between SCL output and input are reported in
*   STRETCH_COUNT \ref Cy_SCB_I2C_GetStretchCount, in number of clk_scb cycles,
*   which can then be set as the STRETCH_THRESHOLD value.
* * The STRETCH_THRESHOLD value should be less than or equal to 0xFUL.
* * When STRETCH_COUNT \ref Cy_SCB_I2C_GetStretchCount is higher than this
*   STRETCH_THRESHOLD, STRETCH_DETECTED \ref Cy_SCB_I2C_IsStretchDetected
*   will be set.
*
* \note
* This API is available for CAT1B and CAT1D devices.
*
*******************************************************************************/
void Cy_SCB_I2C_SetStretchThreshold(CySCB_Type const *base, uint32_t value)
{
    CY_ASSERT_L2(CY_SCB_I2C_STRETCH_THRESHOLD_VALUE_VALID(value));
    SCB_I2C_STRETCH_CTRL(base) = _VAL2FLD(SCB_I2C_STRETCH_CTRL_STRETCH_THRESHOLD, value);
}

/*******************************************************************************
* Function Name: Cy_SCB_I2C_GetStretchCount
****************************************************************************//**
*
* Provides the stretch count. The count is started when the I2C device begins to
* drive high phase on internal SCL output signal and is stalled when it detects
* high level on SCL input signal.
*
* \param base
* The pointer to the I2C SCB instance.
*
* \return
* The stretch count.
*
* \note
* This API is available for CAT1B and CAT1D devices.
*
*******************************************************************************/
uint32_t Cy_SCB_I2C_GetStretchCount(CySCB_Type const *base)
{
    return(_FLD2VAL(SCB_I2C_STRETCH_STATUS_STRETCH_COUNT, SCB_I2C_STRETCH_STATUS(base)));
}

/*******************************************************************************
* Function Name: Cy_SCB_I2C_IsStretchDetected
****************************************************************************//**
*
* Checks if stretch is detected on I2C SCL.
*
* \param base
* The pointer to the I2C SCB instance.
*
* \return
* If true, stretch is detected; false otherwise.
*
* \note
* This API is available for CAT1B and CAT1D devices.
*
*******************************************************************************/
bool Cy_SCB_I2C_IsStretchDetected(CySCB_Type const *base)
{
    return (1UL == (_FLD2VAL(SCB_I2C_STRETCH_STATUS_STRETCH_DETECTED, SCB_I2C_STRETCH_STATUS(base))));
}

/*******************************************************************************
* Function Name: Cy_SCB_I2C_IsSyncDetected
****************************************************************************//**
*
* Checks if synchronization is detected on I2C SCL.
*
* \param base
* The pointer to the I2C SCB instance.
*
* \return
* If true, synchronization is detected; false otherwise.
*
* \note
* This API is available for CAT1B and CAT1D devices.
*
*******************************************************************************/
bool Cy_SCB_I2C_IsSyncDetected(CySCB_Type const *base)
{
    return (1UL == (_FLD2VAL(SCB_I2C_STRETCH_STATUS_SYNC_DETECTED, SCB_I2C_STRETCH_STATUS(base))));
}

/*******************************************************************************
* Function Name: Cy_SCB_I2C_IsStretching
****************************************************************************//**
*
* Checks if I2C SCL is stretched by the block.
*
* \param base
* The pointer to the I2C SCB instance.
*
* \return
* If true, I2C SCL is being stretch by the block, false otherwise.
*
* \note
* This API is available for CAT1B and CAT1D devices.
*
*******************************************************************************/
bool Cy_SCB_I2C_IsStretching(CySCB_Type const *base)
{
    return (1UL == (_FLD2VAL(SCB_I2C_STRETCH_STATUS_STRETCHING, SCB_I2C_STRETCH_STATUS(base))));
}
#endif /* CY_IP_MXSCB_VERSION */

/*******************************************************************************
* Function Name: SlaveHandleAddress
****************************************************************************//**
*
* Prepares the slave for the following Read or Write transfer after the
* matched address was received.
*
* \param base
* The pointer to the I2C SCB instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_scb_i2c_context_t allocated
* by the user. The structure is used during the I2C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
static void SlaveHandleAddress(CySCB_Type *base, cy_stc_scb_i2c_context_t *context)
{
    /* The default command is the ACK address. It can be overridden in an address callback */
    cy_en_scb_i2c_command_t cmd = CY_SCB_I2C_ACK;

    /* The callback for the address in RX FIFO or a general call */
    if (NULL != context->cbAddr)
    {
        uint32_t events = 0UL;

        /* Set an address in the FIFO event if the address accept is enabled */
        if (_FLD2BOOL(SCB_CTRL_ADDR_ACCEPT, SCB_CTRL(base)))
        {
            events = (0UL != (CY_SCB_SLAVE_INTR_I2C_ADDR_MATCH & Cy_SCB_GetSlaveInterruptStatusMasked(base))) ?
                              CY_SCB_I2C_ADDR_IN_FIFO_EVENT : 0UL;
        }

        /* Set a general call event if "ignore general call" is disabled */
        if (!_FLD2BOOL(SCB_I2C_CTRL_S_GENERAL_IGNORE, SCB_I2C_CTRL(base)))
        {
            events |= (0UL != (CY_SCB_SLAVE_INTR_I2C_GENERAL_ADDR & Cy_SCB_GetSlaveInterruptStatusMasked(base))) ?
                               CY_SCB_I2C_GENERAL_CALL_EVENT : 0UL;
        }

